Tronice Ray
Books

# Part 1

<img src = "Data/books erd.png">

# Part 2
created script in Navicat

# Part 3

In [2]:
import pandas as pd
from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists
import pymysql
pymysql.install_as_MySQLdb()
from urllib.parse import quote_plus as urlquote

In [3]:
import json
with open('/Users/troniceray/.secret/mysql.json') as f:
    login = json.load(f)
login.keys()

dict_keys(['username', 'password'])

In [5]:
authors= pd.read_csv('data/authors - authors.csv')
authors.head()

   id        author_name
0   1       Stephen King
1   2  F.Scott Fitgerald
2   3        Jack London
3   4        Jane Austen
4   5       Mary Shelley

In [7]:
users = pd.read_csv('data/users  - users.csv')
users.head()

   id first_name  last_name                 email
0   1       John        Doe          JD@books.com
1   2      Robin      Smith       Robin@books.com
2   3     Gloria  Rodriguez  grodriquez@books.com

In [8]:
books = pd.read_csv('data/books - books.csv')
books.head()

   id                 title  author_id
0   1           The Shining          1
1   2                    It          1
2   3      The Great Gatsby          2
3   4  The Call of the Wild          3
4   5   Pride and Prejudice          4

In [9]:
favorites = pd.read_csv('data/favorites - favorites.csv')
favorites.head()

   user_id  book_id
0        1        1
1        1        2
2        1        3
3        2        4
4        2        5

In [10]:
connection = f"mysql+pymysql://{login['username']}:{urlquote(login['password'])}@localhost/books"
engine = create_engine(connection)

In [11]:
q = '''SHOW TABLES;'''
pd.read_sql(q, engine)

  Tables_in_books
0         authors
1           books
2       favorites
3           users

In [12]:
q = '''DESCRIBE users;'''
pd.read_sql(q, engine)

        Field         Type Null  Key Default Extra
0     user_id          int   NO  PRI    None
1  first_name  varchar(45)  YES         None
2   last_name  varchar(45)  YES         None
3       email  varchar(45)  YES         None

In [13]:
q = '''DESCRIBE books;'''
pd.read_sql(q, engine)

       Field         Type Null  Key Default Extra
0    book_id          int   NO  PRI    None
1      title  varchar(45)  YES         None
2  author_id  varchar(45)  YES         None

In [14]:
q = '''DESCRIBE authors;'''
pd.read_sql(q, engine)

         Field         Type Null  Key Default Extra
0    author_id          int   NO  PRI    None
1  author_name  varchar(45)  YES         None

In [15]:
q = '''DESCRIBE favorites;'''
pd.read_sql(q, engine)

     Field Type Null Key Default Extra
0  book_id  int  YES        None
1  user_id  int  YES        None

In [18]:
books = books.rename({"id":"book_id"}, axis = 1)

In [20]:
books.to_sql('books', engine, index=False, if_exists = 'append')

6

In [19]:
books.head()

   book_id                 title  author_id
0        1           The Shining          1
1        2                    It          1
2        3      The Great Gatsby          2
3        4  The Call of the Wild          3
4        5   Pride and Prejudice          4

In [21]:
authors = authors.rename({"id":"author_id"}, axis = 1)
authors.head()

   author_id        author_name
0          1       Stephen King
1          2  F.Scott Fitgerald
2          3        Jack London
3          4        Jane Austen
4          5       Mary Shelley

In [33]:
authors.to_sql('authors', engine, index=False, if_exists = 'append')

5

In [22]:
users = users.rename({'id':'user_id'}, axis = 1)
users.head()

   user_id first_name  last_name                 email
0        1       John        Doe          JD@books.com
1        2      Robin      Smith       Robin@books.com
2        3     Gloria  Rodriguez  grodriquez@books.com

In [34]:
users.to_sql('users', engine, index=False, if_exists = 'append')

3

In [35]:
favorites.to_sql('favorites', engine, index=False, if_exists = 'append')

7

# Part 4

In [36]:
q = '''SHOW TABLES;'''
pd.read_sql(q, engine)

  Tables_in_books
0         authors
1           books
2       favorites
3           users

In [37]:
q = """SELECT books.title, favorites.user_id
FROM books
JOIN favorites ON books.book_id = favorites.book_id
WHERE favorites.user_id = 
    (SELECT users.user_id FROM users WHERE (users.last_name = "Doe" AND users.first_name = "John"));"""
pd.read_sql(q,engine)

              title  user_id
0       The Shining        1
1                It        1
2  The Great Gatsby        1